Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: The octopus merge can handle multiple branches but is more cautious to avoid difficult conflicts, so it’s chosen as the default strategy if you’re trying to merge more than two branches.
cs: Chobotnicové sloučení dokáže naproti tomu sloučit několik větví, ale je opatrnější s cílem předejít složitým konfliktům. Proto se vybírá jako výchozí strategie při slučování více než dvou větví.

source: The only real difference is that `mv` is one command instead of three — it’s a convenience function.
cs: Jediným skutečným rozdílem je, že `mv` je jediný příkaz, zatímco u druhého způsobu potřebujete příkazy tři — příkaz `mv` je pouze zjednodušením.

source: The only thing left is to enforce fast-forward-only pushes.
cs: Poslední věcí, která nám ještě zbývá, je povolit pouze odeslání směřující „rychle vpřed“ (fast forward).

source: The original commit message for this functionality gives a simple example of running all your C source code through the `indent` program before committing.
cs: Původní zpráva k revizi s touto funkcí uvádí jednoduchý příklad, jak můžete před zapsáním prohnat veškeré vaše céčkové zdrojové texty programem `indent`.

source: The other advantage of this approach is that you get the history of the commits as well.
cs: Další výhodou tohoto postupu je, že získáte rovněž historii revizí.

source: The other files are your new packfile and an index.
cs: Ostatní soubory jsou v novém balíčkovém souboru a indexu.

source: The other important difference is the way you get a listing of the files that have been changed.
cs: Druhým důležitým rozdílem je způsob, jak se zobrazí seznam změněných souborů.

source: The other listing in the `git status` output is the rack entry.
cs: Tím dalším, co se objevuje ve výstupu příkazu `git status`, je položka rack.

source: The other main ancestry specification is the `~`.
cs: Další základní možností označení původu je znak `~`.

source: The other main way to specify a commit is via its ancestry.
cs: Další základní způsob, jak specifikovat konkrétní revizi, je na základě jejího původu.

source: The other major way is to install Git via MacPorts (`http://www.macports.org`).
cs: Jiným obvyklým způsobem je instalace systému Git prostřednictvím systému MacPorts (`http://www.macports.org`).

source: The other thing `gc` will do is pack up your references into a single file.
cs: Další operací, kterou `gc` provede, je zabalení referencí do jediného souboru.

source: The other two network protocols (HTTP and Git) are generally read-only, so even if you have them available for the unwashed masses, you still need SSH for your own write commands.
cs: Oba zbývající síťové protokoly (HTTP i Git) jsou většinou určeny pouze ke čtení, a proto i když je dáváte k dispozici ostatním, pro sebe budete potřebovat SSH protokol pro příkazy zápisu.

source: The other way to move introduced work from one branch to another is to cherry-pick it.
cs: Druhým způsobem, jak přesunout práci z jedné větve do druhé, je tzv. částečné převzetí (angl. cherry picking, tedy něco jako „vyzobání třešniček“).

source: The other way you can do this is via server-side receive hooks, which I’ll cover in a bit.
cs: Druhou možností, jak to provést, jsou přijímací zásuvné moduly (receive hooks) na straně serveru, jimž se budu věnovat později.

source: The output can be sent to the maintainer—it tells them where the work was branched from, summarizes the commits, and tells where to pull this work from.
cs: Výstup příkazu lze odeslat správci. Sdělí mu, odkud daná větev pochází, podá mu přehled o revizích a řekne mu, odkud lze práci stáhnout.

source: The output from the command is a 40-character checksum hash.
cs: Výstupem příkazu je 40znakový otisk kontrolního součtu (checksum hash).

source: The output looks like this:
cs: Jeho výstup vypadá takto:

source: The packed repository size is down to 7K, which is much better than 2MB.
cs: Velikost zabaleného repozitáře byla zredukována na 7 kB, což je jistě lepší než 2 MB.

source: The packfile is a single file containing the contents of all the objects that were removed from your filesystem.
cs: Balíčkový soubor je jediný soubor, v němž je zabalen obsah všech objektů odstraněných ze systému souborů.

source: The pre hooks can exit non-zero at any time to reject the push as well as print an error message back to the client; you can set up a push policy that’s as complex as you wish.
cs: Zásuvné moduly spouštěné před přijetím revizí mohou v případě nenulového výstupu odesílaná data kdykoli odmítnout a poslat klientovi chybové hlášení. Díky nim můžete nastavit libovolně komplexní požadavky na odesílané revize.

source: The presence of that file tells Git that it’s OK to serve this project without authentication.
cs: Přítomnost tohoto souboru systému Git sděluje, že si přejete obsluhovat tento projekt bez ověřování totožnosti.

source: The previous example uses the `git://` protocol, but you may also see `http(s)://` or `user@server:/path.git`, which uses the SSH transfer protocol.
cs: Předchozí příklad využívá protokol `git://`, můžete se ale setkat také s protokolem `http(s)://` nebo `user@server:/path.git`, který používá přenosový protokol SSH.

source: The problem is, you don’t want to do a commit of half-done work just so you can get back to this point later.
cs: Problém je, že nebudete chtít zapsat revizi nehotové práce, budete se k ní chtít vrátit později.

source: The process works as follows (see Figure 5-2):
cs: Postup práce je následující (viz obrázek 5-2):

source: The process works like this (see Figure 5-3):
cs: Postup práce je následující (viz obrázek 5-3):

source: The project maintainer pushes to their public repository.
cs: Správce projektu odešle data do svého veřejného repozitáře.

source: The project snapshot at the tip of the branch is identical whether you do one commit or five, as long as all the changes are added at some point, so try to make things easier on your fellow developers when they have to review your changes.
cs: Snímek projektu na vrcholu větve bude stejný, ať zapíšete jednu revizi, nebo pět (za předpokladu, že vložíte všechny změny). Snažte se proto usnadnit práci svým kolegům, kteří – možná – budou vaše změny kontrolovat.

source: The pros of file-based repositories are that they’re simple and they use existing file permissions and network access.
cs: Výhoda souborových repozitářů spočívá v tom, že jsou jednoduché a používají existující oprávnění k souborům a síťový přístup.

source: The pros of using SSH are many.
cs: Používání protokolu SSH přináší mnoho výhod.

source: The public keys look something like this:
cs: Veřejné klíče mají zhruba tuto podobu:

source: The question now is, when you run `git branch (branchname)`, how does Git know the SHA-1 of the last commit?
cs: Nyní se však nabízí otázka, jak může Git při spuštění příkazu `git branch (název větve)` znát hodnotu SHA-1 poslední revize.

source: The really interesting part is that the UI for this tool for adding people and determining access isn’t a web interface but a special Git repository.
cs: Nejzajímavější je na nástroji Gitosis jeho uživatelské rozhraní pro přidávání uživatelů a specifikaci přístupu – nejedná se totiž o webové rozhraní, ale o speciální repozitář Git.

source: The really nice thing about this is that it can be repacked at any time.
cs: Na celém balíčku je navíc příjemné, že ho můžete kdykoli znovu zabalit do nové podoby.

source: The reason is that if the work isn’t accepted or is cherry picked, you don’t have to rewind your master branch.
cs: Důvod je prostý: pokud nebude vaše práce přijata nebo bude převzata částečně, nebudete muset vracet změny začleněné do vaší hlavní větve.

source: The reason to do it this way is speed — because Git doesn’t have to check out each revision to disk before running your filter, the process can be much, much faster.
cs: Důvodem je rychlost. Git nemusí před spuštěním filtru provádět checkout každé jednotlivé revize na disk a celý proces je tak mnohem, mnohem rychlejší.

source: The reason to prefer rebasing is that Subversion has a linear history and doesn’t deal with merges like Git does, so `git svn` follows only the first parent when converting the snapshots into Subversion commits.
cs: Důvod, proč raději využít možnosti přeskládání, spočívá v tom, že Subversion uchovává lineární historii a neprovádí začleňování stejně jako Git. Takže `git svn` při konverzi snímků na revize Subversion sleduje pouze prvního rodiče.

source: The references won’t be the same on someone else’s copy of the repository; and right after you initially clone a repository, you’ll have an empty reflog, as no activity has occurred yet in your repository.
cs: V kopii repozitáře na počítači kohokoli jiného se budou tyto reference lišit. Bezprostředně poté, co poprvé naklonujete repozitář, bude váš reflog prázdný, protože ve vašem repozitáři ještě nebyla provedena žádná operace.

source: The reflog is also updated by the `git update-ref` command, which is another reason to use it instead of just writing the SHA value to your ref files, as we covered in the "Git References" section of this chapter earlier.
cs: Reflog se také aktualizuje s každým spuštěním příkazu `git update-ref` – o důvod víc používat tento příkaz a nezapisovat hodnotu SHA přímo do souborů referencí, jak už jsme uváděli v části „Reference Git“ v této kapitole.

source: The repo.or.cz and GitHub hosting sites both support this, and many project maintainers expect this style of contribution.
cs: Jak server repo.or.cz, tak místa pro hostování podporují štěpení a mnoho správců projektů tento styl přispívání vyžaduje.

source: The result tells you the changes you’ve made that you haven’t yet staged.
cs: Výsledek vám ukáže provedené změny, které jste dosud nepřipravili k zapsání.

source: The rules for the patterns you can put in the `.gitignore` file are as follows:
cs: Pravidla pro masky, které můžete použít v souboru `.gitignore`, jsou následující:

source: The same approach that we used for MS Word files (`*.doc`) can be used for OpenDocument Text files (`*.odt`) created by OpenOffice.org.
cs: Stejný postup, který jsme použili pro soubory MS Word (`*.doc`), můžeme použít i pro soubory ve formátu OpenDocument Text (`*.odt`), které vytváří OpenOffice.org.

source: The same commit-message editor fires up, but it already contains the message of your previous commit.
cs: Spustí se stejný editor pro editaci zpráv k revizím, ale tentokrát už obsahuje zprávu z vaší předchozí revize.

source: The script puts helpful instructions in the rebase message:
cs: Skript vám ve zprávě k přeskládání podává užitečné instrukce:

source: The second clones an existing Git repository from another server.
cs: Druhý způsob spočívá v naklonování již existujícího repozitáře Git z jiného serveru.

source: The second command is `git svn show-ignore`, which prints to stdout the lines you need to put in a `.gitignore` file so you can redirect the output into your project exclude file:
cs: Druhým z příkazů je `git svn show-ignore`, který zobrazí standardní výstup stdout s řádky, které budete muset vložit do souboru `.gitignore`. Výstup pak můžete přesměrovat do souboru exclude svého projektu:

source: The second developer must merge in the first one’s work before pushing changes up, so as not to overwrite the first developer’s changes.
cs: Druhý vývojář musí před odesláním svých změn začlenit práci prvního vývojáře do své, aby nepřepsal jeho změny.

source: The second developer, Jessica, does the same thing — clones the repository and commits a change:
cs: Druhý vývojář, Jessica, učiní totéž – naklonuje repozitář a zapíše provedené změny:

source: The second level, applicable only to "write" access, is by branch or tag within a repository.
cs: Druhá úroveň se dá použít jen pro práva pro „zápis“ a vázána na větve nebo značky v repozitáři.

source: The second line tells Git to ignore all files that end with a tilde (`~`), which is used by many text editors such as Emacs to mark temporary files.
cs: Druhý řádek systému Git říká, aby ignoroval všechny soubory končící vlnovkou (`~`), kterou mnoho textových editorů (např. Emacs) používá k označení dočasných souborů.

source: The second part of this chapter covers how to migrate your project into Git: first from Subversion, then from Perforce, and finally via a custom import script for a nonstandard importing case.
cs: V druhé části této kapitoly se proto naučíte, jak přesunout svůj projekt do systému Git: nejprve ze systému Subversion, poté z Perforce a nakonec pomocí vlastního skriptu i v případech nestandardního importu.

source: The sequence for the workflow you saw here is something like Figure 5-15.
cs: Posloupnost kroků vypadá v případě pracovního postupu, který jsme si právě ukázali, jako na obrázku 5-15.

source: The sequence looks basically like this:
cs: Posloupnost příkazů bude tedy následující:

source: The server-side hooks are for Git server operations such as receiving pushed commits.
cs: Zásuvné moduly na straně serveru se týkají operací serveru Git, např. přijímání odeslaných revizí.

source: The simple case is the example you just saw, running `git checkout -b [branch] [remotename]/[branch]`.
cs: Jednoduchým případem je příklad, který jste právě viděli: spuštění příkazu `git checkout -b [větev] [vzdálený server]/[větev]`.

source: The simplest setup you’re likely to encounter is a private project with one or two other developers.
cs: Nejjednodušší sestavou, s níž se pravděpodobně setkáte, je soukromý projekt, na němž kromě vás pracují ještě jeden nebo dva vývojáři.

source: The simplest way to commit is to type `git commit`:
cs: Nejjednodušší způsob zapsání změn spočívá v použití příkazu `git commit`:

source: The stable branches are farther down the line in your commit history, and the bleeding-edge branches are farther up the history (see Figure 3-18).
cs: Stabilní větve leží v linii historie revizí níže a nové, neověřené větve se nacházejí nad nimi (viz obrázek 3-18).

source: The staging area is a simple file, generally contained in your Git directory, that stores information about what will go into your next commit.
cs: Oblast připravených změn je jednoduchý soubor, většinou uložený v adresáři Git, který obsahuje informace o tom, co bude obsahovat příští revize.

source: The status of the simplegit.rb file is interesting.
cs: Zajímavý je stav souboru simplegit.rb.

source: The subdirectory is named with the first 2 characters of the SHA, and the filename is the remaining 38 characters.
cs: Podadresář je pojmenován prvními dvěma znaky SHA, název souboru zbývajícími 38 znaky.

source: The tag object is very much like a commit object — it contains a tagger, a date, a message, and a pointer.
cs: Objekt značky se v mnohém podobá objektu revize – obsahuje autora značky, datum, zprávu a ukazatel.

source: The test project has only about 75 commits and the codebase isn’t that big, so it takes just a few minutes.
cs: Testovací projekt má pouze kolem 75 revizí a základ kódu není příliš velký, takže bude stačit několik minut.

source: The third column in the output is the size of the object’s content, so you can see that the content of `05408` takes up 12K, but that of `9bc1d` only takes up 7 bytes.
cs: Třetí sloupec výpisu udává velikost objektu v balíčku. Můžete si tak všimnout, že blob `05408` zabírá 12 kB z celkové velikosti souboru, zatímco blob `9bc1d` pouze 7 bytů.

source: The third type of reference that you’ll see is a remote reference.
cs: Třetím typem reference, s níž se setkáte, je reference na vzdálený repozitář.

source: The trick is finding that latest commit SHA — it’s not like you’ve memorized it, right?
cs: Trik spočívá v určení hodnoty SHA nejnovější revize, protože nepředpokládáme, že si ji pamatujete.

source: The two that are disabled by default but can be turned on are `indent-with-non-tab`, which looks for lines that begin with eight or more spaces instead of tabs, and `cr-at-eol`, which tells Git that carriage returns at the end of lines are OK.
cs: Funkce, které jsou standardně vypnuté, ale lze je zapnout, jsou `indent-with-non-tab`, která vyhledává řádky začínající osmi nebo více mezerami místo tabulátoru, a `cr-at-eol`, která systému Git sděluje, že návraty vozíku na koncích řádků jsou v pořádku.

source: The two that are turned on by default are `trailing-space`, which looks for spaces at the end of a line, and `space-before-tab`, which looks for spaces before tabs at the beginning of a line.
cs: Funkce, které jsou standardně zapnuté, jsou `trailing-space`, která vyhledává mezery na koncích řádků, a `space-before-tab`, která vyhledává mezery před tabulátory na začátcích řádků.

source: The update file runs once per branch being pushed and takes the reference being pushed to, the old revision where that branch was, and the new revision being pushed.
cs: Soubor update bude spuštěn jednou na každou odesílanou větev a jako parametr použije referenci, do níž se odesílá, starou revizi, kde byla tato větev umístěna, a novou, odesílanou revizi.

source: The update script is very similar to the `pre-receive` script, except that it’s run once for each branch the pusher is trying to update.
cs: Skript update je velice podobný skriptu `pre-receive`, avšak s tím rozdílem, že se spouští zvlášť pro každou větev, kterou chce odesílatel aktualizovat.

source: The upside of using the HTTP protocol is that it’s easy to set up.
cs: Pro používání protokolu HTTP mluví zejména jeho snadné nastavení.

source: The username, the access being attempted (`W` or `+`), and the refname being updated are known.
cs: Uživatelské jméno uživatele snažícího se o přístup (`W` nebo `+`) a jméno reference, kterou uživatel chce aktualizovat, jsou dané.

source: The way Git branches is incredibly lightweight, making branching operations nearly instantaneous and switching back and forth between branches generally just as fast.
cs: Větvení je v systému Git neuvěřitelně snadné a operace s ním související probíhají téměř okamžitě. A stejně rychlé je i přepínání mezi jednotlivými větvemi.

source: The whole method looks like this:
cs: Celá metoda vypadá takto:

source: The workflow is similar to the previous use case — you create topic branches for each patch series you work on.
cs: Pracovní postup je podobný jako v předchozím případě. Pro každou sérii záplat, na níž pracujete, vytvoříte samostatnou tematickou větev.

source: The workflow required in order to contribute to a project is much different if you have write access to the project than if you don’t.
cs: Pracovní postup při přispívání do projektu se velmi liší podle toho, zda máte, či nemáte oprávnění k zápisu do projektu.

source: The working directory is a single checkout of one version of the project.
cs: Pracovní adresář obsahuje lokální kopii jedné verze projektu.

source: The world isn’t perfect.
cs: Svět není dokonalý.

source: The “clean” filter is run when files are staged.
cs: Filtr clean spuštěný při přípravě souborů k zapsání – git add

source: The “smudge” filter is run on checkout.
cs: Filtr smudge spuštěný při checkoutu – git checkout

source: Then run these commands:
cs: Potom proveďte následující příkazy:

source: Then you can add the submodule:
cs: Proto ho musíte nejprve vrátit, až potom můžete přidat submodul:

source: Then, Git spits out a bunch of log information looking something like this for each patch you’re sending:
cs: Git poté vytvoří log s určitými informacemi, který bude pro každou záplatu, kterou posíláte, vypadat asi takto:

source: Then, I ran `git diff` to see what changed:
cs: Poté jsem spustil příkaz `git diff`, abych se podíval, co se změnilo:

source: Then, John, Josie, or Jessica can push the first version of their project into that repository by adding it as a remote and pushing up a branch.
cs: John, Josie a Jessica pak mohou do tohoto repozitáře odeslat první verzi svého projektu: přidají si ho jako vzdálený repozitář a odešlou do něj svou větev.

source: Then, compile and install:
cs: Poté spusťte kompilaci a instalaci:

source: Then, enable all users to change revprops — the easy way is to add a pre-revprop-change script that always exits 0:
cs: Poté umožněte všem uživatelům měnit vlastnosti vlastnosti revprops – jednoduše to provedete přidáním skriptu pre-revprop-change, jehož návratovou hodnotou bude vždy 0:

source: Then, for each of those, you find which files are modified and make sure the user who’s pushing has access to all the paths being modified.
cs: U každé z revizí uvidíte také soubory, které byly změněny, a budete se moci přesvědčit, zda má odesílající uživatel přístup ke všem umístěním, která svými daty mění.

source: Then, if you run `git rm`, it stages the file’s removal:
cs: Pokud nyní provedete příkaz `git rm`, bude k zapsání připraveno odstranění souboru:

source: Then, it adds a space followed by the size of the content and finally a null byte:
cs: Poté vloží mezeru, za níž bude následovat velikost obsahu a na konec nulový byte:

source: Then, open the file with `File.open()` and write out the previously zlib-compressed content to the file with a `write()` call on the resulting file handle:
cs: Poté zadejte `File.open()` pro otevření souboru a voláním `write()` na vzniklý identifikátor souboru zapište do souboru právě zkomprimovaný (zlib) obsah:

source: Then, run
cs: Poté spusťte příkaz:

source: Then, she can see what has been changed with `git log`:
cs: Poté si může příkazem `git log` prohlédnout, co všechno bylo změněno:

source: Then, tell Git what the "indent" filter does on smudge and clean:
cs: Poté řekněte systému Git, co má filter indent dělat v situacích smudge a clean:

source: Then, they commit a pointer to that non-public state and push up the superproject.
cs: Poté zapíše ukazatel do tohoto neveřejného stavu a superprojekt odešle na server.

source: Then, when the codebase on that branch is stable and passes tests, you merge it into a develop branch; and when that has proven itself stable for a while, you fast-forward your master branch.
cs: Teprve pokud je kód v této větvi stabilní a projde testováním, začleníte ho do větve develop. A až se větev develop ukáže v některém okamžiku jako stabilní, posunete rychle vpřed i svou hlavní větev.

source: Then, when you switch back, you get an empty `rack` directory.
cs: Až poté přepnete zpět, bude adresář `rack` prázdný.

source: Then, write some new content to the file, and save it again:
cs: Poté do souboru zapište nový obsah a znovu ho uložte:

source: Then, you branched off that to make the client-side changes (`client`) and committed a few times.
cs: Poté jste tuto větev opustili a začali pracovat na změnách na straně klienta (`client`). I tady jste zapsali několik revizí.

source: Then, you can directly import the key into the Git database by exporting it and piping that through `git hash-object`, which writes a new blob with those contents into Git and gives you back the SHA-1 of the blob:
cs: Poté můžete klíč přímo importovat do databáze Git: vyexportujte ho a použijte příkaz `git hash-object`, který zapíše nový blob s tímto obsahem do systému Git a vrátí vám otisk SHA-1 tohoto blobu:

source: Then, you can fast-forward the base branch (`master`):
cs: Poté se můžete přesunout „rychle vpřed“ po základně (větev `master`):

source: Then, you can merge those changes back into your master branch.
cs: Tyto změny pak můžete začlenit zpět do hlavní větve.

source: Then, you can push to and pull from that remote as though you were doing so over a network.
cs: Poté můžete odesílat data a stahovat je z tohoto vzdáleného serveru, jako byste tak činili prostřednictvím sítě.

source: Then, you can see the previous commit by specifying `HEAD^`, which means "the parent of HEAD":
cs: Zobrazit předchozí revizi pak můžete pomocí `HEAD^`, což doslova znamená „rodič revize HEAD“:
